; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	Star3 - direction
	Star5 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Planet9 spectrograph2)
	(have_image Planet10 spectrograph1)
	(have_image Star11 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 planet9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet9)
   goals met: 0 of 7
5. (take_image satellite1 planet9 instrument3 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite1 planet10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet10)
   goals met: 1 of 7
7. (take_image satellite1 planet10 instrument3 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon6 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon6 instrument3 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 3 of 7
10. (turn_to satellite0 star8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star8)
   goals met: 4 of 7
11. (turn_to satellite1 star11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star11)
   goals met: 4 of 7
12. (take_image satellite1 star11 instrument3 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 5 of 7
13. (turn_to satellite1 star7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star7)
   goals met: 5 of 7
14. (take_image satellite1 star7 instrument3 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 6 of 7
15. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 6 of 7
16. (take_image satellite1 star8 instrument3 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 7 of 7
